; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x11-y11-t5-k55555-l55555-p50-neargoal-d19)
(:domain grid)
(:objects f0-0f f1-0f f2-0f f3-0f f4-0f f5-0f f6-0f f7-0f f8-0f f9-0f f10-0f f0-1f f1-1f f2-1f f3-1f f4-1f f5-1f f6-1f f7-1f f8-1f f9-1f f10-1f f0-2f f1-2f f2-2f f3-2f f4-2f f5-2f f6-2f f7-2f f8-2f f9-2f f10-2f f0-3f f1-3f f2-3f f3-3f f4-3f f5-3f f6-3f f7-3f f8-3f f9-3f f10-3f f0-4f f1-4f f2-4f f3-4f f4-4f f5-4f f6-4f f7-4f f8-4f f9-4f f10-4f f0-5f f1-5f f2-5f f3-5f f4-5f f5-5f f6-5f f7-5f f8-5f f9-5f f10-5f f0-6f f1-6f f2-6f f3-6f f4-6f f5-6f f6-6f f7-6f f8-6f f9-6f f10-6f f0-7f f1-7f f2-7f f3-7f f4-7f f5-7f f6-7f f7-7f f8-7f f9-7f f10-7f f0-8f f1-8f f2-8f f3-8f f4-8f f5-8f f6-8f f7-8f f8-8f f9-8f f10-8f f0-9f f1-9f f2-9f f3-9f f4-9f f5-9f f6-9f f7-9f f8-9f f9-9f f10-9f f0-10f f1-10f f2-10f f3-10f f4-10f f5-10f f6-10f f7-10f f8-10f f9-10f f10-10f shape0 shape1 shape2 shape3 shape4 key0-0 key0-1 key0-2 key0-3 key0-4 key1-0 key1-1 key1-2 key1-3 key1-4 key2-0 key2-1 key2-2 key2-3 key2-4 key3-0 key3-1 key3-2 key3-3 key3-4 key4-0 key4-1 key4-2 key4-3 key4-4)
(:init
(arm-empty)
(at key0-0 f6-5f)
(at key0-1 f4-9f)
(at key0-2 f5-8f)
(at key0-3 f9-10f)
(at key0-4 f4-8f)
(at key1-0 f0-3f)
(at key1-1 f1-10f)
(at key1-2 f2-3f)
(at key1-3 f4-1f)
(at key1-4 f10-6f)
(at key2-0 f10-6f)
(at key2-1 f8-10f)
(at key2-2 f7-10f)
(at key2-3 f3-1f)
(at key2-4 f2-1f)
(at key3-0 f5-1f)
(at key3-1 f1-1f)
(at key3-2 f4-9f)
(at key3-3 f0-8f)
(at key3-4 f2-6f)
(at key4-0 f1-1f)
(at key4-1 f6-9f)
(at key4-2 f7-0f)
(at key4-3 f6-10f)
(at key4-4 f4-10f)
(at-robot f3-4f)
(conn f0-0f f0-1f)
(conn f0-0f f1-0f)
(conn f0-10f f0-9f)
(conn f0-10f f1-10f)
(conn f0-1f f0-0f)
(conn f0-1f f0-2f)
(conn f0-1f f1-1f)
(conn f0-2f f0-1f)
(conn f0-2f f0-3f)
(conn f0-2f f1-2f)
(conn f0-3f f0-2f)
(conn f0-3f f0-4f)
(conn f0-3f f1-3f)
(conn f0-4f f0-3f)
(conn f0-4f f0-5f)
(conn f0-4f f1-4f)
(conn f0-5f f0-4f)
(conn f0-5f f0-6f)
(conn f0-5f f1-5f)
(conn f0-6f f0-5f)
(conn f0-6f f0-7f)
(conn f0-6f f1-6f)
(conn f0-7f f0-6f)
(conn f0-7f f0-8f)
(conn f0-7f f1-7f)
(conn f0-8f f0-7f)
(conn f0-8f f0-9f)
(conn f0-8f f1-8f)
(conn f0-9f f0-10f)
(conn f0-9f f0-8f)
(conn f0-9f f1-9f)
(conn f1-0f f0-0f)
(conn f1-0f f1-1f)
(conn f1-0f f2-0f)
(conn f1-10f f0-10f)
(conn f1-10f f1-9f)
(conn f1-10f f2-10f)
(conn f1-1f f0-1f)
(conn f1-1f f1-0f)
(conn f1-1f f1-2f)
(conn f1-1f f2-1f)
(conn f1-2f f0-2f)
(conn f1-2f f1-1f)
(conn f1-2f f1-3f)
(conn f1-2f f2-2f)
(conn f1-3f f0-3f)
(conn f1-3f f1-2f)
(conn f1-3f f1-4f)
(conn f1-3f f2-3f)
(conn f1-4f f0-4f)
(conn f1-4f f1-3f)
(conn f1-4f f1-5f)
(conn f1-4f f2-4f)
(conn f1-5f f0-5f)
(conn f1-5f f1-4f)
(conn f1-5f f1-6f)
(conn f1-5f f2-5f)
(conn f1-6f f0-6f)
(conn f1-6f f1-5f)
(conn f1-6f f1-7f)
(conn f1-6f f2-6f)
(conn f1-7f f0-7f)
(conn f1-7f f1-6f)
(conn f1-7f f1-8f)
(conn f1-7f f2-7f)
(conn f1-8f f0-8f)
(conn f1-8f f1-7f)
(conn f1-8f f1-9f)
(conn f1-8f f2-8f)
(conn f1-9f f0-9f)
(conn f1-9f f1-10f)
(conn f1-9f f1-8f)
(conn f1-9f f2-9f)
(conn f10-0f f10-1f)
(conn f10-0f f9-0f)
(conn f10-10f f10-9f)
(conn f10-10f f9-10f)
(conn f10-1f f10-0f)
(conn f10-1f f10-2f)
(conn f10-1f f9-1f)
(conn f10-2f f10-1f)
(conn f10-2f f10-3f)
(conn f10-2f f9-2f)
(conn f10-3f f10-2f)
(conn f10-3f f10-4f)
(conn f10-3f f9-3f)
(conn f10-4f f10-3f)
(conn f10-4f f10-5f)
(conn f10-4f f9-4f)
(conn f10-5f f10-4f)
(conn f10-5f f10-6f)
(conn f10-5f f9-5f)
(conn f10-6f f10-5f)
(conn f10-6f f10-7f)
(conn f10-6f f9-6f)
(conn f10-7f f10-6f)
(conn f10-7f f10-8f)
(conn f10-7f f9-7f)
(conn f10-8f f10-7f)
(conn f10-8f f10-9f)
(conn f10-8f f9-8f)
(conn f10-9f f10-10f)
(conn f10-9f f10-8f)
(conn f10-9f f9-9f)
(conn f2-0f f1-0f)
(conn f2-0f f2-1f)
(conn f2-0f f3-0f)
(conn f2-10f f1-10f)
(conn f2-10f f2-9f)
(conn f2-10f f3-10f)
(conn f2-1f f1-1f)
(conn f2-1f f2-0f)
(conn f2-1f f2-2f)
(conn f2-1f f3-1f)
(conn f2-2f f1-2f)
(conn f2-2f f2-1f)
(conn f2-2f f2-3f)
(conn f2-2f f3-2f)
(conn f2-3f f1-3f)
(conn f2-3f f2-2f)
(conn f2-3f f2-4f)
(conn f2-3f f3-3f)
(conn f2-4f f1-4f)
(conn f2-4f f2-3f)
(conn f2-4f f2-5f)
(conn f2-4f f3-4f)
(conn f2-5f f1-5f)
(conn f2-5f f2-4f)
(conn f2-5f f2-6f)
(conn f2-5f f3-5f)
(conn f2-6f f1-6f)
(conn f2-6f f2-5f)
(conn f2-6f f2-7f)
(conn f2-6f f3-6f)
(conn f2-7f f1-7f)
(conn f2-7f f2-6f)
(conn f2-7f f2-8f)
(conn f2-7f f3-7f)
(conn f2-8f f1-8f)
(conn f2-8f f2-7f)
(conn f2-8f f2-9f)
(conn f2-8f f3-8f)
(conn f2-9f f1-9f)
(conn f2-9f f2-10f)
(conn f2-9f f2-8f)
(conn f2-9f f3-9f)
(conn f3-0f f2-0f)
(conn f3-0f f3-1f)
(conn f3-0f f4-0f)
(conn f3-10f f2-10f)
(conn f3-10f f3-9f)
(conn f3-10f f4-10f)
(conn f3-1f f2-1f)
(conn f3-1f f3-0f)
(conn f3-1f f3-2f)
(conn f3-1f f4-1f)
(conn f3-2f f2-2f)
(conn f3-2f f3-1f)
(conn f3-2f f3-3f)
(conn f3-2f f4-2f)
(conn f3-3f f2-3f)
(conn f3-3f f3-2f)
(conn f3-3f f3-4f)
(conn f3-3f f4-3f)
(conn f3-4f f2-4f)
(conn f3-4f f3-3f)
(conn f3-4f f3-5f)
(conn f3-4f f4-4f)
(conn f3-5f f2-5f)
(conn f3-5f f3-4f)
(conn f3-5f f3-6f)
(conn f3-5f f4-5f)
(conn f3-6f f2-6f)
(conn f3-6f f3-5f)
(conn f3-6f f3-7f)
(conn f3-6f f4-6f)
(conn f3-7f f2-7f)
(conn f3-7f f3-6f)
(conn f3-7f f3-8f)
(conn f3-7f f4-7f)
(conn f3-8f f2-8f)
(conn f3-8f f3-7f)
(conn f3-8f f3-9f)
(conn f3-8f f4-8f)
(conn f3-9f f2-9f)
(conn f3-9f f3-10f)
(conn f3-9f f3-8f)
(conn f3-9f f4-9f)
(conn f4-0f f3-0f)
(conn f4-0f f4-1f)
(conn f4-0f f5-0f)
(conn f4-10f f3-10f)
(conn f4-10f f4-9f)
(conn f4-10f f5-10f)
(conn f4-1f f3-1f)
(conn f4-1f f4-0f)
(conn f4-1f f4-2f)
(conn f4-1f f5-1f)
(conn f4-2f f3-2f)
(conn f4-2f f4-1f)
(conn f4-2f f4-3f)
(conn f4-2f f5-2f)
(conn f4-3f f3-3f)
(conn f4-3f f4-2f)
(conn f4-3f f4-4f)
(conn f4-3f f5-3f)
(conn f4-4f f3-4f)
(conn f4-4f f4-3f)
(conn f4-4f f4-5f)
(conn f4-4f f5-4f)
(conn f4-5f f3-5f)
(conn f4-5f f4-4f)
(conn f4-5f f4-6f)
(conn f4-5f f5-5f)
(conn f4-6f f3-6f)
(conn f4-6f f4-5f)
(conn f4-6f f4-7f)
(conn f4-6f f5-6f)
(conn f4-7f f3-7f)
(conn f4-7f f4-6f)
(conn f4-7f f4-8f)
(conn f4-7f f5-7f)
(conn f4-8f f3-8f)
(conn f4-8f f4-7f)
(conn f4-8f f4-9f)
(conn f4-8f f5-8f)
(conn f4-9f f3-9f)
(conn f4-9f f4-10f)
(conn f4-9f f4-8f)
(conn f4-9f f5-9f)
(conn f5-0f f4-0f)
(conn f5-0f f5-1f)
(conn f5-0f f6-0f)
(conn f5-10f f4-10f)
(conn f5-10f f5-9f)
(conn f5-10f f6-10f)
(conn f5-1f f4-1f)
(conn f5-1f f5-0f)
(conn f5-1f f5-2f)
(conn f5-1f f6-1f)
(conn f5-2f f4-2f)
(conn f5-2f f5-1f)
(conn f5-2f f5-3f)
(conn f5-2f f6-2f)
(conn f5-3f f4-3f)
(conn f5-3f f5-2f)
(conn f5-3f f5-4f)
(conn f5-3f f6-3f)
(conn f5-4f f4-4f)
(conn f5-4f f5-3f)
(conn f5-4f f5-5f)
(conn f5-4f f6-4f)
(conn f5-5f f4-5f)
(conn f5-5f f5-4f)
(conn f5-5f f5-6f)
(conn f5-5f f6-5f)
(conn f5-6f f4-6f)
(conn f5-6f f5-5f)
(conn f5-6f f5-7f)
(conn f5-6f f6-6f)
(conn f5-7f f4-7f)
(conn f5-7f f5-6f)
(conn f5-7f f5-8f)
(conn f5-7f f6-7f)
(conn f5-8f f4-8f)
(conn f5-8f f5-7f)
(conn f5-8f f5-9f)
(conn f5-8f f6-8f)
(conn f5-9f f4-9f)
(conn f5-9f f5-10f)
(conn f5-9f f5-8f)
(conn f5-9f f6-9f)
(conn f6-0f f5-0f)
(conn f6-0f f6-1f)
(conn f6-0f f7-0f)
(conn f6-10f f5-10f)
(conn f6-10f f6-9f)
(conn f6-10f f7-10f)
(conn f6-1f f5-1f)
(conn f6-1f f6-0f)
(conn f6-1f f6-2f)
(conn f6-1f f7-1f)
(conn f6-2f f5-2f)
(conn f6-2f f6-1f)
(conn f6-2f f6-3f)
(conn f6-2f f7-2f)
(conn f6-3f f5-3f)
(conn f6-3f f6-2f)
(conn f6-3f f6-4f)
(conn f6-3f f7-3f)
(conn f6-4f f5-4f)
(conn f6-4f f6-3f)
(conn f6-4f f6-5f)
(conn f6-4f f7-4f)
(conn f6-5f f5-5f)
(conn f6-5f f6-4f)
(conn f6-5f f6-6f)
(conn f6-5f f7-5f)
(conn f6-6f f5-6f)
(conn f6-6f f6-5f)
(conn f6-6f f6-7f)
(conn f6-6f f7-6f)
(conn f6-7f f5-7f)
(conn f6-7f f6-6f)
(conn f6-7f f6-8f)
(conn f6-7f f7-7f)
(conn f6-8f f5-8f)
(conn f6-8f f6-7f)
(conn f6-8f f6-9f)
(conn f6-8f f7-8f)
(conn f6-9f f5-9f)
(conn f6-9f f6-10f)
(conn f6-9f f6-8f)
(conn f6-9f f7-9f)
(conn f7-0f f6-0f)
(conn f7-0f f7-1f)
(conn f7-0f f8-0f)
(conn f7-10f f6-10f)
(conn f7-10f f7-9f)
(conn f7-10f f8-10f)
(conn f7-1f f6-1f)
(conn f7-1f f7-0f)
(conn f7-1f f7-2f)
(conn f7-1f f8-1f)
(conn f7-2f f6-2f)
(conn f7-2f f7-1f)
(conn f7-2f f7-3f)
(conn f7-2f f8-2f)
(conn f7-3f f6-3f)
(conn f7-3f f7-2f)
(conn f7-3f f7-4f)
(conn f7-3f f8-3f)
(conn f7-4f f6-4f)
(conn f7-4f f7-3f)
(conn f7-4f f7-5f)
(conn f7-4f f8-4f)
(conn f7-5f f6-5f)
(conn f7-5f f7-4f)
(conn f7-5f f7-6f)
(conn f7-5f f8-5f)
(conn f7-6f f6-6f)
(conn f7-6f f7-5f)
(conn f7-6f f7-7f)
(conn f7-6f f8-6f)
(conn f7-7f f6-7f)
(conn f7-7f f7-6f)
(conn f7-7f f7-8f)
(conn f7-7f f8-7f)
(conn f7-8f f6-8f)
(conn f7-8f f7-7f)
(conn f7-8f f7-9f)
(conn f7-8f f8-8f)
(conn f7-9f f6-9f)
(conn f7-9f f7-10f)
(conn f7-9f f7-8f)
(conn f7-9f f8-9f)
(conn f8-0f f7-0f)
(conn f8-0f f8-1f)
(conn f8-0f f9-0f)
(conn f8-10f f7-10f)
(conn f8-10f f8-9f)
(conn f8-10f f9-10f)
(conn f8-1f f7-1f)
(conn f8-1f f8-0f)
(conn f8-1f f8-2f)
(conn f8-1f f9-1f)
(conn f8-2f f7-2f)
(conn f8-2f f8-1f)
(conn f8-2f f8-3f)
(conn f8-2f f9-2f)
(conn f8-3f f7-3f)
(conn f8-3f f8-2f)
(conn f8-3f f8-4f)
(conn f8-3f f9-3f)
(conn f8-4f f7-4f)
(conn f8-4f f8-3f)
(conn f8-4f f8-5f)
(conn f8-4f f9-4f)
(conn f8-5f f7-5f)
(conn f8-5f f8-4f)
(conn f8-5f f8-6f)
(conn f8-5f f9-5f)
(conn f8-6f f7-6f)
(conn f8-6f f8-5f)
(conn f8-6f f8-7f)
(conn f8-6f f9-6f)
(conn f8-7f f7-7f)
(conn f8-7f f8-6f)
(conn f8-7f f8-8f)
(conn f8-7f f9-7f)
(conn f8-8f f7-8f)
(conn f8-8f f8-7f)
(conn f8-8f f8-9f)
(conn f8-8f f9-8f)
(conn f8-9f f7-9f)
(conn f8-9f f8-10f)
(conn f8-9f f8-8f)
(conn f8-9f f9-9f)
(conn f9-0f f10-0f)
(conn f9-0f f8-0f)
(conn f9-0f f9-1f)
(conn f9-10f f10-10f)
(conn f9-10f f8-10f)
(conn f9-10f f9-9f)
(conn f9-1f f10-1f)
(conn f9-1f f8-1f)
(conn f9-1f f9-0f)
(conn f9-1f f9-2f)
(conn f9-2f f10-2f)
(conn f9-2f f8-2f)
(conn f9-2f f9-1f)
(conn f9-2f f9-3f)
(conn f9-3f f10-3f)
(conn f9-3f f8-3f)
(conn f9-3f f9-2f)
(conn f9-3f f9-4f)
(conn f9-4f f10-4f)
(conn f9-4f f8-4f)
(conn f9-4f f9-3f)
(conn f9-4f f9-5f)
(conn f9-5f f10-5f)
(conn f9-5f f8-5f)
(conn f9-5f f9-4f)
(conn f9-5f f9-6f)
(conn f9-6f f10-6f)
(conn f9-6f f8-6f)
(conn f9-6f f9-5f)
(conn f9-6f f9-7f)
(conn f9-7f f10-7f)
(conn f9-7f f8-7f)
(conn f9-7f f9-6f)
(conn f9-7f f9-8f)
(conn f9-8f f10-8f)
(conn f9-8f f8-8f)
(conn f9-8f f9-7f)
(conn f9-8f f9-9f)
(conn f9-9f f10-9f)
(conn f9-9f f8-9f)
(conn f9-9f f9-10f)
(conn f9-9f f9-8f)
(key key0-0)
(key key0-1)
(key key0-2)
(key key0-3)
(key key0-4)
(key key1-0)
(key key1-1)
(key key1-2)
(key key1-3)
(key key1-4)
(key key2-0)
(key key2-1)
(key key2-2)
(key key2-3)
(key key2-4)
(key key3-0)
(key key3-1)
(key key3-2)
(key key3-3)
(key key3-4)
(key key4-0)
(key key4-1)
(key key4-2)
(key key4-3)
(key key4-4)
(key-shape key0-0 shape0)
(key-shape key0-1 shape0)
(key-shape key0-2 shape0)
(key-shape key0-3 shape0)
(key-shape key0-4 shape0)
(key-shape key1-0 shape1)
(key-shape key1-1 shape1)
(key-shape key1-2 shape1)
(key-shape key1-3 shape1)
(key-shape key1-4 shape1)
(key-shape key2-0 shape2)
(key-shape key2-1 shape2)
(key-shape key2-2 shape2)
(key-shape key2-3 shape2)
(key-shape key2-4 shape2)
(key-shape key3-0 shape3)
(key-shape key3-1 shape3)
(key-shape key3-2 shape3)
(key-shape key3-3 shape3)
(key-shape key3-4 shape3)
(key-shape key4-0 shape4)
(key-shape key4-1 shape4)
(key-shape key4-2 shape4)
(key-shape key4-3 shape4)
(key-shape key4-4 shape4)
(lock-shape f0-2f shape2)
(lock-shape f0-5f shape4)
(lock-shape f1-0f shape3)
(lock-shape f1-3f shape4)
(lock-shape f1-5f shape0)
(lock-shape f10-1f shape3)
(lock-shape f10-2f shape3)
(lock-shape f2-10f shape1)
(lock-shape f2-3f shape4)
(lock-shape f2-5f shape2)
(lock-shape f2-7f shape4)
(lock-shape f2-9f shape4)
(lock-shape f3-2f shape2)
(lock-shape f4-3f shape1)
(lock-shape f4-7f shape0)
(lock-shape f4-9f shape1)
(lock-shape f5-5f shape3)
(lock-shape f5-7f shape2)
(lock-shape f6-2f shape0)
(lock-shape f6-9f shape0)
(lock-shape f7-1f shape1)
(lock-shape f7-4f shape3)
(lock-shape f8-0f shape1)
(lock-shape f8-3f shape2)
(lock-shape f8-4f shape0)
(locked f0-2f)
(locked f0-5f)
(locked f1-0f)
(locked f1-5f)
(locked f10-1f)
(locked f10-2f)
(locked f2-10f)
(locked f2-5f)
(locked f2-7f)
(locked f4-7f)
(locked f5-5f)
(locked f5-7f)
(locked f6-2f)
(locked f7-1f)
(locked f7-4f)
(locked f8-0f)
(locked f8-3f)
(locked f8-4f)
(open f0-0f)
(open f0-10f)
(open f0-1f)
(open f0-3f)
(open f0-4f)
(open f0-6f)
(open f0-7f)
(open f0-8f)
(open f0-9f)
(open f1-10f)
(open f1-1f)
(open f1-2f)
(open f1-3f)
(open f1-4f)
(open f1-6f)
(open f1-7f)
(open f1-8f)
(open f1-9f)
(open f10-0f)
(open f10-10f)
(open f10-3f)
(open f10-4f)
(open f10-5f)
(open f10-6f)
(open f10-7f)
(open f10-8f)
(open f10-9f)
(open f2-0f)
(open f2-1f)
(open f2-2f)
(open f2-3f)
(open f2-4f)
(open f2-6f)
(open f2-8f)
(open f2-9f)
(open f3-0f)
(open f3-10f)
(open f3-1f)
(open f3-2f)
(open f3-3f)
(open f3-4f)
(open f3-5f)
(open f3-6f)
(open f3-7f)
(open f3-8f)
(open f3-9f)
(open f4-0f)
(open f4-10f)
(open f4-1f)
(open f4-2f)
(open f4-3f)
(open f4-4f)
(open f4-5f)
(open f4-6f)
(open f4-8f)
(open f4-9f)
(open f5-0f)
(open f5-10f)
(open f5-1f)
(open f5-2f)
(open f5-3f)
(open f5-4f)
(open f5-6f)
(open f5-8f)
(open f5-9f)
(open f6-0f)
(open f6-10f)
(open f6-1f)
(open f6-3f)
(open f6-4f)
(open f6-5f)
(open f6-6f)
(open f6-7f)
(open f6-8f)
(open f6-9f)
(open f7-0f)
(open f7-10f)
(open f7-2f)
(open f7-3f)
(open f7-5f)
(open f7-6f)
(open f7-7f)
(open f7-8f)
(open f7-9f)
(open f8-10f)
(open f8-1f)
(open f8-2f)
(open f8-5f)
(open f8-6f)
(open f8-7f)
(open f8-8f)
(open f8-9f)
(open f9-0f)
(open f9-10f)
(open f9-1f)
(open f9-2f)
(open f9-3f)
(open f9-4f)
(open f9-5f)
(open f9-6f)
(open f9-7f)
(open f9-8f)
(open f9-9f)
(place f0-0f)
(place f0-10f)
(place f0-1f)
(place f0-2f)
(place f0-3f)
(place f0-4f)
(place f0-5f)
(place f0-6f)
(place f0-7f)
(place f0-8f)
(place f0-9f)
(place f1-0f)
(place f1-10f)
(place f1-1f)
(place f1-2f)
(place f1-3f)
(place f1-4f)
(place f1-5f)
(place f1-6f)
(place f1-7f)
(place f1-8f)
(place f1-9f)
(place f10-0f)
(place f10-10f)
(place f10-1f)
(place f10-2f)
(place f10-3f)
(place f10-4f)
(place f10-5f)
(place f10-6f)
(place f10-7f)
(place f10-8f)
(place f10-9f)
(place f2-0f)
(place f2-10f)
(place f2-1f)
(place f2-2f)
(place f2-3f)
(place f2-4f)
(place f2-5f)
(place f2-6f)
(place f2-7f)
(place f2-8f)
(place f2-9f)
(place f3-0f)
(place f3-10f)
(place f3-1f)
(place f3-2f)
(place f3-3f)
(place f3-4f)
(place f3-5f)
(place f3-6f)
(place f3-7f)
(place f3-8f)
(place f3-9f)
(place f4-0f)
(place f4-10f)
(place f4-1f)
(place f4-2f)
(place f4-3f)
(place f4-4f)
(place f4-5f)
(place f4-6f)
(place f4-7f)
(place f4-8f)
(place f4-9f)
(place f5-0f)
(place f5-10f)
(place f5-1f)
(place f5-2f)
(place f5-3f)
(place f5-4f)
(place f5-5f)
(place f5-6f)
(place f5-7f)
(place f5-8f)
(place f5-9f)
(place f6-0f)
(place f6-10f)
(place f6-1f)
(place f6-2f)
(place f6-3f)
(place f6-4f)
(place f6-5f)
(place f6-6f)
(place f6-7f)
(place f6-8f)
(place f6-9f)
(place f7-0f)
(place f7-10f)
(place f7-1f)
(place f7-2f)
(place f7-3f)
(place f7-4f)
(place f7-5f)
(place f7-6f)
(place f7-7f)
(place f7-8f)
(place f7-9f)
(place f8-0f)
(place f8-10f)
(place f8-1f)
(place f8-2f)
(place f8-3f)
(place f8-4f)
(place f8-5f)
(place f8-6f)
(place f8-7f)
(place f8-8f)
(place f8-9f)
(place f9-0f)
(place f9-10f)
(place f9-1f)
(place f9-2f)
(place f9-3f)
(place f9-4f)
(place f9-5f)
(place f9-6f)
(place f9-7f)
(place f9-8f)
(place f9-9f)
(shape shape0)
(shape shape1)
(shape shape2)
(shape shape3)
(shape shape4)
)
(:goal (and
(at key0-0 f0-10f)
(at key1-1 f1-10f)
(at key1-2 f2-3f)
(at key1-4 f10-6f)
(at key2-3 f3-1f)
(at key2-4 f2-1f)
(at key3-0 f5-1f)
(at key3-1 f1-1f)
(at key3-2 f4-9f)
(at key3-4 f2-6f)
(at key4-2 f7-0f)
(at key4-3 f6-10f)
))
)

; plan
1. (move f3-4f f3-5f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-5f)
   goals met: 11 of 12
2. (move f3-5f f3-6f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-6f)
   goals met: 11 of 12
3. (move f3-6f f4-6f)
   deleted: (at-robot f3-6f)
   added: (at-robot f4-6f)
   goals met: 11 of 12
4. (move f4-6f f5-6f)
   deleted: (at-robot f4-6f)
   added: (at-robot f5-6f)
   goals met: 11 of 12
5. (move f5-6f f6-6f)
   deleted: (at-robot f5-6f)
   added: (at-robot f6-6f)
   goals met: 11 of 12
6. (move f6-6f f6-5f)
   deleted: (at-robot f6-6f)
   added: (at-robot f6-5f)
   goals met: 11 of 12
7. (pickup f6-5f key0-0)
   deleted: (at key0-0 f6-5f) (arm-empty)
   added: (holding key0-0)
   goals met: 11 of 12
8. (move f6-5f f6-6f)
   deleted: (at-robot f6-5f)
   added: (at-robot f6-6f)
   goals met: 11 of 12
9. (move f6-6f f5-6f)
   deleted: (at-robot f6-6f)
   added: (at-robot f5-6f)
   goals met: 11 of 12
10. (move f5-6f f4-6f)
   deleted: (at-robot f5-6f)
   added: (at-robot f4-6f)
   goals met: 11 of 12
11. (move f4-6f f3-6f)
   deleted: (at-robot f4-6f)
   added: (at-robot f3-6f)
   goals met: 11 of 12
12. (move f3-6f f3-7f)
   deleted: (at-robot f3-6f)
   added: (at-robot f3-7f)
   goals met: 11 of 12
13. (move f3-7f f3-8f)
   deleted: (at-robot f3-7f)
   added: (at-robot f3-8f)
   goals met: 11 of 12
14. (move f3-8f f2-8f)
   deleted: (at-robot f3-8f)
   added: (at-robot f2-8f)
   goals met: 11 of 12
15. (move f2-8f f2-9f)
   deleted: (at-robot f2-8f)
   added: (at-robot f2-9f)
   goals met: 11 of 12
16. (move f2-9f f1-9f)
   deleted: (at-robot f2-9f)
   added: (at-robot f1-9f)
   goals met: 11 of 12
17. (move f1-9f f1-10f)
   deleted: (at-robot f1-9f)
   added: (at-robot f1-10f)
   goals met: 11 of 12
18. (move f1-10f f0-10f)
   deleted: (at-robot f1-10f)
   added: (at-robot f0-10f)
   goals met: 11 of 12
19. (putdown f0-10f key0-0)
   deleted: (holding key0-0)
   added: (arm-empty) (at key0-0 f0-10f)
   goals met: 12 of 12
